var ptx_lunr_search_style = "textbook";
var ptx_lunr_docs = [
{
  "id": "colophon-1",
  "level": "1",
  "url": "colophon-1.html",
  "type": "هاوپلان",
  "number": "",
  "title": "هاوپلان",
  "body": "   example.org   https:\/\/example.org   copyright  "
},
{
  "id": "S-1-1",
  "level": "1",
  "url": "S-1-1.html",
  "type": "بەش",
  "number": "1.1",
  "title": "بەشی یەکەم لقی یەکەم",
  "body": " بەشی یەکەم لقی یەکەم  گه‌ر له‌ كۆمه‌ڵێك بیركاریزان بپرسیت كه‌ ئایا جوانترین بیردۆزی بیركاری له‌لاتان چیه‌؟ ئه‌وا زۆرێك له‌و وه‌ڵامانه‌ی به‌رگوێت ده‌كه‌ویت بریتی ده‌بێت له‌ ناڕێژه‌ییبوونی   كه‌له‌لایه‌ن فیساگۆرس و شوێنكه‌وتووه‌كانیه‌وه‌ سه‌لمێنراوه‌. واته‌ فیساگۆرسیه‌كان سه‌لماندیان كه‌ ژماره‌یه‌كی ناڕێژه‌ییه‌ .  به‌لام سه‌ره‌تا ده‌بیت باس له‌وه‌ بكه‌ین كه‌ ئایا ژماره‌ی ناڕێژه‌یی چیه‌؟    . گه‌ر كه‌سێك له‌بیركاری كه‌مێك شاره‌زا نه‌بێت و ئه‌م پێناسه‌یه‌ی سه‌ره‌وه‌ی بۆ بخوێنیته‌وه‌ ، له‌وانیه‌ واهه‌ستبكات گاڵته‌ی له‌گه‌ل ده‌كه‌یت یاخود نوكته‌ی بۆ ده‌ڵێت { ناهه‌قیشی نیه‌) ، چونكه‌ له‌ پێناسه‌كه‌ی سه‌ره‌وه‌ هه‌ستده‌كه‌یت گه‌مه‌كردنێك هه‌یه‌ به‌ ووشه‌ { وه‌كو ئه‌وه‌ وایه‌ كه‌سێك پێناسه‌ی شتیكی بۆن ناخۆشت بۆ بكات و بڵێت هه‌ر شتێك بۆنی خۆش نه‌بێت ئه‌وا ناخۆشه‌ !}. به‌هه‌رحاڵ ، بۆ ئێمه‌ی بیركاریزان ئه‌م جۆره‌ پێناسانه‌ زۆر ئاسایین و له‌سه‌رجه‌م ئه‌ده‌بیاتی بیركاریدا به‌ئاشكرا بوونی هه‌یه‌ و ڕاهاتووین له‌گه‌ڵی. با بگه‌رێنه‌وه‌ بۆ پێناسه‌كه‌ كه‌ باسی ژماره‌یی ڕێژه‌یی مان كردووه‌، كه‌واته‌ بۆ تێگه‌یشتن له‌ ژماره‌ی ناڕێژه‌یی ده‌بێت سه‌ره‌تا باس له‌ژماره‌ی ڕێژه‌یی بكه‌یت، وه‌ هه‌ڵبه‌ت له‌ڕووی مێژوویشه‌وه‌ ئه‌مه‌ گونجاوه‌، چونكه‌ مێژووی دروستبوونی ژماره‌ی ڕێژه‌یی ده‌كه‌وێته‌ پێش مێژووی له‌دایكبوونی ژماره‌ ناڕێژه‌یه‌كان، وه‌ له‌دایكبوونه‌كه‌یشی زه‌حمه‌تی زۆری پێوه‌كێشرا ( به‌لایه‌نی كه‌مه‌وه‌ نه‌فه‌رێك له‌سه‌ر ژماره‌ ناڕێژه‌یه‌كان كوژرا). پێناسه‌ی ژماره‌یی ڕێژه‌یی:- به‌ژماره‌یه‌كی راستی ده‌وترێت ڕێژه‌یی گه‌ر هاتوو بتوانرێت به‌شێوه‌ی كه‌رتی وه‌كو بنوسرێت كاتێك هه‌ریه‌كه‌ له‌ ژماره‌كانی ژماره‌ی ته‌واو بن، وه‌ مه‌رجیشه‌ .      ژماره‌یی ناڕێژه‌یی به‌ژماره‌یه‌كی ڕاستی ده‌وترێت ناڕێژه‌یی گه‌ر هاتوو ڕێژه‌یی نه‌بوو له‌پێناسه‌كه‌وه‌ هه‌ستده‌كه‌یت كه‌ هه‌موو ژماره‌یه‌كی ته‌واو ژماره‌یه‌كی ڕێژه‌ییه‌، بو نموونه‌ 7- ده‌توانرێت به‌م شێوه‌یه‌ بنووسرێت .به‌لام به‌دڵنیایه‌وه‌ مه‌رج نیه‌ ژماره‌ی ڕێژه‌یی ژماره‌یه‌كی ته‌واو بێت. بۆ ئه‌مه‌یش نموونه‌مان هه‌یه‌ . ژماره‌یه‌كی ڕێژه‌ییه‌ به‌لام ژماره‌یه‌كی ته‌واو نیه‌! وه‌ ئێمه‌ی بیركاریزان ئه‌م قسه‌یه‌ی سه‌ره‌وه‌ له‌ ده‌سته‌واژه‌یه‌كدا كۆده‌كه‌ینه‌وه‌ كه‌ ده‌ڵێت ژماره‌ ته‌واوه‌كان به‌شه‌كۆمه‌له‌یه‌كه‌ له‌ ژماره‌ ڕێژه‌ییه‌كان وه‌ گه‌ر به‌شێوه‌یه‌كی فه‌رمی به‌م شێوه‌یه‌ ده‌نوسرێت .   ئێستا دوای ئه‌وه‌ی زانیمان پێناسه‌ی ژماره‌ی ناڕێژه‌یی چیه‌ كاتی ئه‌وه‌ هاتووه‌ كۆمه‌ڵێك نموونه‌ی له‌سه‌ر بخه‌ینه‌ ڕوو ، ئه‌مانه‌ی خواره‌وه‌ له‌به‌ناوبانگترین ژماره‌ ناڕێژه‌ییه‌كانن:- ( یان ڕه‌گی دووجای هه‌ر ژماره‌یه‌كی خۆبه‌ش ! ). پای یاخود ڕێژه‌ی نه‌گۆڕ كه‌ به‌نزیكی ده‌كاته‌ 3.14 ژماره‌ی ئۆیله‌ر.كه‌ به‌نزیكی ده‌كاته‌ 2.71 . ئه‌م ژمارانه‌ی سه‌ره‌وه‌ هه‌موویان نارێژه‌یین. به‌لام ته‌نها باس له‌ سه‌لماندنی یه‌كه‌م ده‌كه‌ین چونكه‌ ئه‌وانی تر كه‌مێك پێشكه‌وتوترن و پیویست به‌ زانیاری زیاتر هه‌یه‌ ، سه‌لماندنه‌كه‌ی ڕه‌گی دوو قوتابی قوناغی ناوه‌ندیش لێیحالیده‌بێت. به‌لام دوو ژماره‌كه‌ی تر بۆ سه‌لماندنیان پێویستیمان به‌كه‌مێك میتۆدی تر ده‌بێت كه‌ زیاتر له‌ زانكۆ ده‌خوێنرێت.  بۆیه‌ ئێمه‌ لێره‌دا ته‌نها یه‌كه‌م ژماره‌ ده‌سه‌لمێنین كه‌ ناڕێژییه‌، تاوه‌كو زۆرترین خوێنه‌ر سودی ڵێوه‌ربگرێت.  لە خوارەوە جۆرێک لە نەخشە پێناسە دەکەین کە پیی دەوترێت نەخشەی چەندلەتە، کە بوارەکە دابەشدەبیت بۆ چەند بەش و لە هەربەشەی نەخشەیەکی جەبری تایبەت بەخۆی هەیە.    دۆزینەوەی تەواوکاری نەخشەیەک لەڕێگای سەیجەوە  Sage cell with a title   دەتوانی وەکو نموونەی لە خوارەوە پیشاندارەوە، تەواوکاری نەخشەیەک بدۆزیتەوە، نەخشەکە دوو دراوی هەیە، یەکەم نەخشەکەیە وە دووهەم گۆڕاوەکەیە   "
},
{
  "id": "thm",
  "level": "2",
  "url": "S-1-1.html#thm",
  "type": "بیردۆز",
  "number": "1.1.1",
  "title": "",
  "body": "  . گه‌ر كه‌سێك له‌بیركاری كه‌مێك شاره‌زا نه‌بێت و ئه‌م پێناسه‌یه‌ی سه‌ره‌وه‌ی بۆ بخوێنیته‌وه‌ ، له‌وانیه‌ واهه‌ستبكات گاڵته‌ی له‌گه‌ل ده‌كه‌یت یاخود نوكته‌ی بۆ ده‌ڵێت { ناهه‌قیشی نیه‌) ، چونكه‌ له‌ پێناسه‌كه‌ی سه‌ره‌وه‌ هه‌ستده‌كه‌یت گه‌مه‌كردنێك هه‌یه‌ به‌ ووشه‌ { وه‌كو ئه‌وه‌ وایه‌ كه‌سێك پێناسه‌ی شتیكی بۆن ناخۆشت بۆ بكات و بڵێت هه‌ر شتێك بۆنی خۆش نه‌بێت ئه‌وا ناخۆشه‌ !}. به‌هه‌رحاڵ ، بۆ ئێمه‌ی بیركاریزان ئه‌م جۆره‌ پێناسانه‌ زۆر ئاسایین و له‌سه‌رجه‌م ئه‌ده‌بیاتی بیركاریدا به‌ئاشكرا بوونی هه‌یه‌ و ڕاهاتووین له‌گه‌ڵی. با بگه‌رێنه‌وه‌ بۆ پێناسه‌كه‌ كه‌ باسی ژماره‌یی ڕێژه‌یی مان كردووه‌، كه‌واته‌ بۆ تێگه‌یشتن له‌ ژماره‌ی ناڕێژه‌یی ده‌بێت سه‌ره‌تا باس له‌ژماره‌ی ڕێژه‌یی بكه‌یت، وه‌ هه‌ڵبه‌ت له‌ڕووی مێژوویشه‌وه‌ ئه‌مه‌ گونجاوه‌، چونكه‌ مێژووی دروستبوونی ژماره‌ی ڕێژه‌یی ده‌كه‌وێته‌ پێش مێژووی له‌دایكبوونی ژماره‌ ناڕێژه‌یه‌كان، وه‌ له‌دایكبوونه‌كه‌یشی زه‌حمه‌تی زۆری پێوه‌كێشرا ( به‌لایه‌نی كه‌مه‌وه‌ نه‌فه‌رێك له‌سه‌ر ژماره‌ ناڕێژه‌یه‌كان كوژرا). پێناسه‌ی ژماره‌یی ڕێژه‌یی:- به‌ژماره‌یه‌كی راستی ده‌وترێت ڕێژه‌یی گه‌ر هاتوو بتوانرێت به‌شێوه‌ی كه‌رتی وه‌كو بنوسرێت كاتێك هه‌ریه‌كه‌ له‌ ژماره‌كانی ژماره‌ی ته‌واو بن، وه‌ مه‌رجیشه‌ .   "
},
{
  "id": "definition-1",
  "level": "2",
  "url": "S-1-1.html#definition-1",
  "type": "پێناسە",
  "number": "1.1.2",
  "title": "",
  "body": " ژماره‌یی ناڕێژه‌یی به‌ژماره‌یه‌كی ڕاستی ده‌وترێت ناڕێژه‌یی گه‌ر هاتوو ڕێژه‌یی نه‌بوو له‌پێناسه‌كه‌وه‌ هه‌ستده‌كه‌یت كه‌ هه‌موو ژماره‌یه‌كی ته‌واو ژماره‌یه‌كی ڕێژه‌ییه‌، بو نموونه‌ 7- ده‌توانرێت به‌م شێوه‌یه‌ بنووسرێت .به‌لام به‌دڵنیایه‌وه‌ مه‌رج نیه‌ ژماره‌ی ڕێژه‌یی ژماره‌یه‌كی ته‌واو بێت. بۆ ئه‌مه‌یش نموونه‌مان هه‌یه‌ . ژماره‌یه‌كی ڕێژه‌ییه‌ به‌لام ژماره‌یه‌كی ته‌واو نیه‌! وه‌ ئێمه‌ی بیركاریزان ئه‌م قسه‌یه‌ی سه‌ره‌وه‌ له‌ ده‌سته‌واژه‌یه‌كدا كۆده‌كه‌ینه‌وه‌ كه‌ ده‌ڵێت ژماره‌ ته‌واوه‌كان به‌شه‌كۆمه‌له‌یه‌كه‌ له‌ ژماره‌ ڕێژه‌ییه‌كان وه‌ گه‌ر به‌شێوه‌یه‌كی فه‌رمی به‌م شێوه‌یه‌ ده‌نوسرێت . "
},
{
  "id": "S-1-2",
  "level": "1",
  "url": "S-1-2.html",
  "type": "بەش",
  "number": "1.2",
  "title": "بەشەی یەکەم لە لقی دووهەم",
  "body": " بەشەی یەکەم لە لقی دووهەم   یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:-   "
},
{
  "id": "definition-2",
  "level": "2",
  "url": "S-1-2.html#definition-2",
  "type": "پێناسە",
  "number": "1.2.1",
  "title": "",
  "body": "یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:- "
},
{
  "id": "S-2-1",
  "level": "1",
  "url": "S-2-1.html",
  "type": "بەش",
  "number": "2.1",
  "title": "بەشەی یەکەم لە لقی دووهەم",
  "body": " بەشەی یەکەم لە لقی دووهەم   یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:-   "
},
{
  "id": "definition-3",
  "level": "2",
  "url": "S-2-1.html#definition-3",
  "type": "پێناسە",
  "number": "2.1.1",
  "title": "",
  "body": "یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:- "
},
{
  "id": "S-2-2",
  "level": "1",
  "url": "S-2-2.html",
  "type": "بەش",
  "number": "2.2",
  "title": "بەشی دووهەم لقی دووهەم",
  "body": " بەشی دووهەم لقی دووهەم   یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:-    هێڵکاری نەخشەی    True\/False vector space  Every vector space has finite dimension.   The vector space of all polynomials with finite degree has a basis, , which is infinte.    , the vector space of polynomials with degree at most , has dimension by . [Cross-reference is just a demo, content is not relevant.] What happens if we relax the defintion and remove the parameter ?   "
},
{
  "id": "definition-4",
  "level": "2",
  "url": "S-2-2.html#definition-4",
  "type": "پێناسە",
  "number": "2.2.1",
  "title": "",
  "body": "یه‌كبه‌دوای یه‌كی فیبانۆشی (fibonacci sequence) بریتیه‌ له‌ زنجیره‌یه‌ك له‌ ژماره‌ كه‌ هه‌ر ژماره‌یه‌ك له‌م زنجیره‌یه‌ ده‌كاته‌ كۆی دوو ژماره‌كه‌ی پێشخۆی.. له‌خواره‌وه‌ ده‌یه‌كه‌مین دانه‌كانی ئه‌م یه‌كله‌دوای یه‌كه‌ ده‌نووسین:- "
},
{
  "id": "figure-1",
  "level": "2",
  "url": "S-2-2.html#figure-1",
  "type": "وێنە",
  "number": "2.2.2",
  "title": "",
  "body": " هێڵکاری نەخشەی   "
},
{
  "id": "vector-space-dimension",
  "level": "2",
  "url": "S-2-2.html#vector-space-dimension",
  "type": "خاڵی پشکنین",
  "number": "2.2.3",
  "title": "True\/False.",
  "body": "True\/False vector space  Every vector space has finite dimension.   The vector space of all polynomials with finite degree has a basis, , which is infinte.    , the vector space of polynomials with degree at most , has dimension by . [Cross-reference is just a demo, content is not relevant.] What happens if we relax the defintion and remove the parameter ?  "
},
{
  "id": "S-3-1",
  "level": "1",
  "url": "S-3-1.html",
  "type": "بەش",
  "number": "3.1",
  "title": "بەشی یەکەم لقی سيهەم",
  "body": " بەشی یەکەم لقی سيهەم    پیشانی بدە کە ژماره‌یه‌كی نارێژه‌ییه‌ .  سه‌لماندن:- بۆ سه‌لماندنی ئه‌م بیردۆزه‌ میتۆدی دژیه‌ك به‌كارده‌هێنین سه‌ره‌تا واداده‌نێین كه‌ ژماره‌یه‌كی ڕێژه‌ییه‌، واته‌ ده‌توانین به‌م شێوه‌یه‌ بینوسین ، له‌هه‌مانكاتدا واداده‌نێین كه‌رته‌كه‌ ساده‌ترین شێوه‌ی یان باری هه‌یه‌ ، به‌مانایه‌كی تر هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ( بو نموونه‌ 2 وه‌ 4كۆلكه‌ی هاوبه‌شی نێوانیان2,1 به‌لام كۆلكه‌ی هاوبه‌شی نێوان 4,9 ته‌نها ده‌كاته‌ 1){ ده‌كرێت بشلین كه‌ هه‌ردوو ژماره‌ی ده‌بێت كۆخۆبه‌ش بن ئێستا ئه‌م هاوكێشه‌یه‌مان هه‌یه‌:- هه‌ڵده‌ستین به‌ دووجاكردنی هه‌ردوولا پاشان دوولاو دوو نێوان ده‌كه‌ین { هه‌رچه‌نده‌ ئه‌م ده‌سته‌واژه‌یه‌ راسته‌ له‌ڕووی زانسیته‌وه‌ به‌لام له‌ڕووی په‌روه‌رده‌ییه‌وه‌ هه‌ڵه‌یه‌) گه‌ر سه‌رنج له‌ بده‌یت ئه‌وا بۆت ده‌رده‌كه‌وێت كه‌ ژماره‌یه‌كی جووته‌ , ماده‌م جووته‌ ئه‌وا جووته‌ ! ، كه‌واته‌ ژماره‌یه‌كی ته‌واوی وه‌كو هه‌یه‌ كه‌ ، ئێستا ده‌چین و نرخی به‌له‌جیاتیدانان له‌ دوا هاوكێشه‌ داده‌نێینه‌وه‌ وه‌ ئه‌م هاوكێشه‌ نوێیه‌مان ده‌ستده‌كه‌وێت:-   له‌به‌ر هه‌مان هۆكاری پێشووتر ژماره‌ی جووته‌و له‌مه‌یشه‌وه‌ ده‌گه‌ینه‌وه‌ ئه‌و ڕاستیه‌ ژماره‌یه‌كی جووته‌. ئێستا گه‌یشتینه‌ ئه‌و ئه‌نجامه‌ی كه هه‌ردووكیان جووتن، واته‌ به‌لایه‌نی كه‌مه‌وه‌ جگه‌ 1 كۆلكه‌یه‌كی هاوبه‌شی تریان هه‌یه‌ ئه‌ویش ژماره‌ 2 ه‌ ، ئه‌مه‌یش دژیه‌كه‌ ( مه‌عقول نیه‌!) له‌گه‌ل ئه‌و ڕاستیه‌ی كه‌ پێشتر هه‌مانبووه‌ و ده‌یگووت هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ئه‌م دژیه‌كه‌ له‌وه‌وه‌ سه‌رچاوه‌ی گرتووه‌ كه‌ ووتوومانه‌ ژماره‌یه‌كی رێژه‌ییه‌. كه‌واته‌ ژماره‌یه‌كی ناڕێژه‌ییه‌.    "
},
{
  "id": "theorem-2",
  "level": "2",
  "url": "S-3-1.html#theorem-2",
  "type": "بیردۆز",
  "number": "3.1.1",
  "title": "",
  "body": " پیشانی بدە کە ژماره‌یه‌كی نارێژه‌ییه‌ .  سه‌لماندن:- بۆ سه‌لماندنی ئه‌م بیردۆزه‌ میتۆدی دژیه‌ك به‌كارده‌هێنین سه‌ره‌تا واداده‌نێین كه‌ ژماره‌یه‌كی ڕێژه‌ییه‌، واته‌ ده‌توانین به‌م شێوه‌یه‌ بینوسین ، له‌هه‌مانكاتدا واداده‌نێین كه‌رته‌كه‌ ساده‌ترین شێوه‌ی یان باری هه‌یه‌ ، به‌مانایه‌كی تر هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ( بو نموونه‌ 2 وه‌ 4كۆلكه‌ی هاوبه‌شی نێوانیان2,1 به‌لام كۆلكه‌ی هاوبه‌شی نێوان 4,9 ته‌نها ده‌كاته‌ 1){ ده‌كرێت بشلین كه‌ هه‌ردوو ژماره‌ی ده‌بێت كۆخۆبه‌ش بن ئێستا ئه‌م هاوكێشه‌یه‌مان هه‌یه‌:- هه‌ڵده‌ستین به‌ دووجاكردنی هه‌ردوولا پاشان دوولاو دوو نێوان ده‌كه‌ین { هه‌رچه‌نده‌ ئه‌م ده‌سته‌واژه‌یه‌ راسته‌ له‌ڕووی زانسیته‌وه‌ به‌لام له‌ڕووی په‌روه‌رده‌ییه‌وه‌ هه‌ڵه‌یه‌) گه‌ر سه‌رنج له‌ بده‌یت ئه‌وا بۆت ده‌رده‌كه‌وێت كه‌ ژماره‌یه‌كی جووته‌ , ماده‌م جووته‌ ئه‌وا جووته‌ ! ، كه‌واته‌ ژماره‌یه‌كی ته‌واوی وه‌كو هه‌یه‌ كه‌ ، ئێستا ده‌چین و نرخی به‌له‌جیاتیدانان له‌ دوا هاوكێشه‌ داده‌نێینه‌وه‌ وه‌ ئه‌م هاوكێشه‌ نوێیه‌مان ده‌ستده‌كه‌وێت:-   له‌به‌ر هه‌مان هۆكاری پێشووتر ژماره‌ی جووته‌و له‌مه‌یشه‌وه‌ ده‌گه‌ینه‌وه‌ ئه‌و ڕاستیه‌ ژماره‌یه‌كی جووته‌. ئێستا گه‌یشتینه‌ ئه‌و ئه‌نجامه‌ی كه هه‌ردووكیان جووتن، واته‌ به‌لایه‌نی كه‌مه‌وه‌ جگه‌ 1 كۆلكه‌یه‌كی هاوبه‌شی تریان هه‌یه‌ ئه‌ویش ژماره‌ 2 ه‌ ، ئه‌مه‌یش دژیه‌كه‌ ( مه‌عقول نیه‌!) له‌گه‌ل ئه‌و ڕاستیه‌ی كه‌ پێشتر هه‌مانبووه‌ و ده‌یگووت هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ئه‌م دژیه‌كه‌ له‌وه‌وه‌ سه‌رچاوه‌ی گرتووه‌ كه‌ ووتوومانه‌ ژماره‌یه‌كی رێژه‌ییه‌. كه‌واته‌ ژماره‌یه‌كی ناڕێژه‌ییه‌.  "
},
{
  "id": "S-3-2",
  "level": "1",
  "url": "S-3-2.html",
  "type": "بەش",
  "number": "3.2",
  "title": "بەشی دووهەم لقی سيهەم",
  "body": " بەشی دووهەم لقی سيهەم  پرسیاری ريکخراو  هەڵبستە بە پيدانی ئەم جۆرە لە سەرنجانە بە قوتابیان   یەکەم هەنگاو ئەمە بکە   یەک تۆز یارمەتی   تۆزیکی تر یارمەتی   لێرەدا بە تەواوەتی هەموو پرسیارەکان شیکاردەکەین .   دووهەم هەنگاو بۆ شیکارکردن بریتیەە لەمە.   answer   تەواو بووین هەڵدەستین بە کۆکردنەوەی بیرکردنەوەمان   لە خوارەوە پێناسەی تەواوکاری دەکەین، کە ڕاستەوخۆ لەسەر ئامانج بنیاتنراوە:   پرسیاری هەڵبژاردن، نه‌ ڕه‌ندۆمه‌ندراو، تەنها یەک وەڵامی ڕاستی هەیە Multiple-Choice, Not Randomized, One Answer خاڵی وەستان  ئایا خاڵی وەستاندن لە ترافیکدا چ رەنگێکە؟     سەوز    سەوز واتە go! .      سور    بە گشتی ڕەنگی سوور بەکاردیت بۆ هۆشیارکدنەوە لە ڕوداوی مەترسیدار      سپی    رەنگی سپی بە ئاسانی نابینرێت     What did you see last time you went driving?   Maybe go out for a drive?   "
},
{
  "id": "exercise-2",
  "level": "2",
  "url": "S-3-2.html#exercise-2",
  "type": "خاڵی پشکنین",
  "number": "3.2.1",
  "title": "پرسیاری ريکخراو.",
  "body": "پرسیاری ريکخراو  هەڵبستە بە پيدانی ئەم جۆرە لە سەرنجانە بە قوتابیان   یەکەم هەنگاو ئەمە بکە   یەک تۆز یارمەتی   تۆزیکی تر یارمەتی   لێرەدا بە تەواوەتی هەموو پرسیارەکان شیکاردەکەین .   دووهەم هەنگاو بۆ شیکارکردن بریتیەە لەمە.   answer   تەواو بووین هەڵدەستین بە کۆکردنەوەی بیرکردنەوەمان  "
},
{
  "id": "multiple-choice-not-randomized",
  "level": "2",
  "url": "S-3-2.html#multiple-choice-not-randomized",
  "type": "خاڵی پشکنین",
  "number": "3.2.2",
  "title": "پرسیاری هەڵبژاردن، نه‌ ڕه‌ندۆمه‌ندراو، تەنها یەک وەڵامی ڕاستی هەیە Multiple-Choice, Not Randomized, One Answer.",
  "body": "پرسیاری هەڵبژاردن، نه‌ ڕه‌ندۆمه‌ندراو، تەنها یەک وەڵامی ڕاستی هەیە Multiple-Choice, Not Randomized, One Answer خاڵی وەستان  ئایا خاڵی وەستاندن لە ترافیکدا چ رەنگێکە؟     سەوز    سەوز واتە go! .      سور    بە گشتی ڕەنگی سوور بەکاردیت بۆ هۆشیارکدنەوە لە ڕوداوی مەترسیدار      سپی    رەنگی سپی بە ئاسانی نابینرێت     What did you see last time you went driving?   Maybe go out for a drive?  "
},
{
  "id": "colophon-2",
  "level": "1",
  "url": "colophon-2.html",
  "type": "هاوپلان",
  "number": "",
  "title": "هاوپلان",
  "body": " ئەم کتێبە لەڕێگای PreTeXt دروستکراوە.  "
}
]

var ptx_lunr_idx = lunr(function () {
  this.ref('id')
  this.field('title')
  this.field('body')

  ptx_lunr_docs.forEach(function (doc) {
    this.add(doc)
  }, this)
})
