var ptx_lunr_search_style = "textbook";
var ptx_lunr_docs = [
{
  "id": "colophon-1",
  "level": "1",
  "url": "colophon-1.html",
  "type": "[colophon]",
  "number": "",
  "title": "[colophon]",
  "body": "   example.org   https:\/\/example.org   copyright  "
},
{
  "id": "section-title",
  "level": "1",
  "url": "section-title.html",
  "type": "[section]",
  "number": "1.1",
  "title": "ژمارەیی ڕيژەیی",
  "body": " ژمارەیی ڕيژەیی  گه‌ر له‌ كۆمه‌ڵێك بیركاریزان بپرسیت كه‌ ئایا جوانترین بیردۆزی بیركاری له‌لاتان چیه‌؟ ئه‌وا زۆرێك له‌و وه‌ڵامانه‌ی به‌رگوێت ده‌كه‌ویت بریتی ده‌بێت له‌ ناڕێژه‌ییبوونی   كه‌له‌لایه‌ن فیساگۆرس و شوێنكه‌وتووه‌كانیه‌وه‌ سه‌لمێنراوه‌. واته‌ فیساگۆرسیه‌كان سه‌لماندیان كه‌   ژماره‌یه‌كی ناڕێژه‌ییه‌ . به‌لام سه‌ره‌تا ده‌بیت باس له‌وه‌ بكه‌ین كه‌ ئایا ژماره‌ی ناڕێژه‌یی چیه‌؟    . گه‌ر كه‌سێك له‌بیركاری كه‌مێك شاره‌زا نه‌بێت و ئه‌م پێناسه‌یه‌ی سه‌ره‌وه‌ی بۆ بخوێنیته‌وه‌ ، له‌وانیه‌ واهه‌ستبكات گاڵته‌ی له‌گه‌ل ده‌كه‌یت یاخود نوكته‌ی بۆ ده‌ڵێت { ناهه‌قیشی نیه‌) ، چونكه‌ له‌ پێناسه‌كه‌ی سه‌ره‌وه‌ هه‌ستده‌كه‌یت گه‌مه‌كردنێك هه‌یه‌ به‌ ووشه‌ { وه‌كو ئه‌وه‌ وایه‌ كه‌سێك پێناسه‌ی شتیكی بۆن ناخۆشت بۆ بكات و بڵێت هه‌ر شتێك بۆنی خۆش نه‌بێت ئه‌وا ناخۆشه‌ !}. به‌هه‌رحاڵ ، بۆ ئێمه‌ی بیركاریزان ئه‌م جۆره‌ پێناسانه‌ زۆر ئاسایین و له‌سه‌رجه‌م ئه‌ده‌بیاتی بیركاریدا به‌ئاشكرا بوونی هه‌یه‌ و ڕاهاتووین له‌گه‌ڵی. با بگه‌رێنه‌وه‌ بۆ پێناسه‌كه‌ كه‌ باسی ژماره‌یی ڕێژه‌یی مان كردووه‌، كه‌واته‌ بۆ تێگه‌یشتن له‌ ژماره‌ی ناڕێژه‌یی ده‌بێت سه‌ره‌تا باس له‌ژماره‌ی ڕێژه‌یی بكه‌یت، وه‌ هه‌ڵبه‌ت له‌ڕووی مێژوویشه‌وه‌ ئه‌مه‌ گونجاوه‌، چونكه‌ مێژووی دروستبوونی ژماره‌ی ڕێژه‌یی ده‌كه‌وێته‌ پێش مێژووی له‌دایكبوونی ژماره‌ ناڕێژه‌یه‌كان، وه‌ له‌دایكبوونه‌كه‌یشی زه‌حمه‌تی زۆری پێوه‌كێشرا ( به‌لایه‌نی كه‌مه‌وه‌ نه‌فه‌رێك له‌سه‌ر ژماره‌ ناڕێژه‌یه‌كان كوژرا). پێناسه‌ی ژماره‌یی ڕێژه‌یی:- به‌ژماره‌یه‌كی راستی ده‌وترێت ڕێژه‌یی گه‌ر هاتوو بتوانرێت به‌شێوه‌ی كه‌رتی وه‌كو بنوسرێت كاتێك هه‌ریه‌كه‌ له‌ ژماره‌كانی ژماره‌ی ته‌واو بن، وه‌ مه‌رجیشه‌ .    پێناسه‌ی ژماره‌یی ناڕێژه‌یی:- به‌ژماره‌یه‌كی ڕاستی ده‌وترێت ناڕێژه‌یی گه‌ر هاتوو ڕێژه‌یی نه‌بوو له‌پێناسه‌كه‌وه‌ هه‌ستده‌كه‌یت كه‌ هه‌موو ژماره‌یه‌كی ته‌واو ژماره‌یه‌كی ڕێژه‌ییه‌، بو نموونه‌ 7- ده‌توانرێت به‌م شێوه‌یه‌ بنووسرێت .به‌لام به‌دڵنیایه‌وه‌ مه‌رج نیه‌ ژماره‌ی ڕێژه‌یی ژماره‌یه‌كی ته‌واو بێت. بۆ ئه‌مه‌یش نموونه‌مان هه‌یه‌ . ژماره‌یه‌كی ڕێژه‌ییه‌ به‌لام ژماره‌یه‌كی ته‌واو نیه‌! وه‌ ئێمه‌ی بیركاریزان ئه‌م قسه‌یه‌ی سه‌ره‌وه‌ له‌ ده‌سته‌واژه‌یه‌كدا كۆده‌كه‌ینه‌وه‌ كه‌ ده‌ڵێت ژماره‌ ته‌واوه‌كان به‌شه‌كۆمه‌له‌یه‌كه‌ له‌ ژماره‌ ڕێژه‌ییه‌كان وه‌ گه‌ر به‌شێوه‌یه‌كی فه‌رمی به‌م شێوه‌یه‌ ده‌نوسرێت .  ئێستا دوای ئه‌وه‌ی زانیمان پێناسه‌ی ژماره‌ی ناڕێژه‌یی چیه‌ كاتی ئه‌وه‌ هاتووه‌ كۆمه‌ڵێك نموونه‌ی له‌سه‌ر بخه‌ینه‌ ڕوو ، ئه‌مانه‌ی خواره‌وه‌ له‌به‌ناوبانگترین ژماره‌ ناڕێژه‌ییه‌كانن:- ( یان ڕه‌گی دووجای هه‌ر ژماره‌یه‌كی خۆبه‌ش ! ). پای یاخود ڕێژه‌ی نه‌گۆڕ كه‌ به‌نزیكی ده‌كاته‌ 3.14 ژماره‌ی ئۆیله‌ر.كه‌ به‌نزیكی ده‌كاته‌ 2.71 . ئه‌م ژمارانه‌ی سه‌ره‌وه‌ هه‌موویان نارێژه‌یین. به‌لام ته‌نها باس له‌ سه‌لماندنی یه‌كه‌م ده‌كه‌ین چونكه‌ ئه‌وانی تر كه‌مێك پێشكه‌وتوترن و پیویست به‌ زانیاری زیاتر هه‌یه‌ ، سه‌لماندنه‌كه‌ی ڕه‌گی دوو قوتابی قوناغی ناوه‌ندیش لێیحالیده‌بێت. به‌لام دوو ژماره‌كه‌ی تر بۆ سه‌لماندنیان پێویستیمان به‌كه‌مێك میتۆدی تر ده‌بێت كه‌ زیاتر له‌ زانكۆ ده‌خوێنرێت.  بۆیه‌ ئێمه‌ لێره‌دا ته‌نها یه‌كه‌م ژماره‌ ده‌سه‌لمێنین كه‌ ناڕێژییه‌، تاوه‌كو زۆرترین خوێنه‌ر سودی ڵێوه‌ربگرێت.  بیردۆز:- ژماره‌یه‌كی نارێژه‌ییه‌ . سه‌لماندن:- بۆ سه‌لماندنی ئه‌م بیردۆزه‌ میتۆدی دژیه‌ك به‌كارده‌هێنین سه‌ره‌تا واداده‌نێین كه‌ ژماره‌یه‌كی ڕێژه‌ییه‌، واته‌ ده‌توانین به‌م شێوه‌یه‌ بینوسین ، له‌هه‌مانكاتدا واداده‌نێین كه‌رته‌كه‌ ساده‌ترین شێوه‌ی یان باری هه‌یه‌ ، به‌مانایه‌كی تر هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ( بو نموونه‌ 2 وه‌ 4كۆلكه‌ی هاوبه‌شی نێوانیان2,1 به‌لام كۆلكه‌ی هاوبه‌شی نێوان 4,9 ته‌نها ده‌كاته‌ 1){ ده‌كرێت بشلین كه‌ هه‌ردوو ژماره‌ی ده‌بێت كۆخۆبه‌ش بن ئێستا ئه‌م هاوكێشه‌یه‌مان هه‌یه‌:- هه‌ڵده‌ستین به‌ دووجاكردنی هه‌ردوولا پاشان دوولاو دوو نێوان ده‌كه‌ین { هه‌رچه‌نده‌ ئه‌م ده‌سته‌واژه‌یه‌ راسته‌ له‌ڕووی زانسیته‌وه‌ به‌لام له‌ڕووی په‌روه‌رده‌ییه‌وه‌ هه‌ڵه‌یه‌) گه‌ر سه‌رنج له‌ بده‌یت ئه‌وا بۆت ده‌رده‌كه‌وێت كه‌ ژماره‌یه‌كی جووته‌ , ماده‌م جووته‌ ئه‌وا جووته‌ ! ، كه‌واته‌ ژماره‌یه‌كی ته‌واوی وه‌كو هه‌یه‌ كه‌ ، ئێستا ده‌چین و نرخی به‌له‌جیاتیدانان له‌ دوا هاوكێشه‌ داده‌نێینه‌وه‌ وه‌ ئه‌م هاوكێشه‌ نوێیه‌مان ده‌ستده‌كه‌وێت:-   له‌به‌ر هه‌مان هۆكاری پێشووتر ژماره‌ی جووته‌و له‌مه‌یشه‌وه‌ ده‌گه‌ینه‌وه‌ ئه‌و ڕاستیه‌ ژماره‌یه‌كی جووته‌. ئێستا گه‌یشتینه‌ ئه‌و ئه‌نجامه‌ی كه هه‌ردووكیان جووتن، واته‌ به‌لایه‌نی كه‌مه‌وه‌ جگه‌ 1 كۆلكه‌یه‌كی هاوبه‌شی تریان هه‌یه‌ ئه‌ویش ژماره‌ 2 ه‌ ، ئه‌مه‌یش دژیه‌كه‌ ( مه‌عقول نیه‌!) له‌گه‌ل ئه‌و ڕاستیه‌ی كه‌ پێشتر هه‌مانبووه‌ و ده‌یگووت هه‌ردوو ژماره‌ی ته‌نها یه‌ك كۆلكه‌ی هاوبه‌شیان هه‌یه‌ ئه‌ویش 1 ه‌ . ئه‌م دژیه‌كه‌ له‌وه‌وه‌ سه‌رچاوه‌ی گرتووه‌ كه‌ ووتوومانه‌ ژماره‌یه‌كی رێژه‌ییه‌. كه‌واته‌ ژماره‌یه‌كی ناڕێژه‌ییه‌.  "
},
{
  "id": "thm-",
  "level": "2",
  "url": "section-title.html#thm-",
  "type": "[theorem]",
  "number": "1.1.1",
  "title": "",
  "body": "  . گه‌ر كه‌سێك له‌بیركاری كه‌مێك شاره‌زا نه‌بێت و ئه‌م پێناسه‌یه‌ی سه‌ره‌وه‌ی بۆ بخوێنیته‌وه‌ ، له‌وانیه‌ واهه‌ستبكات گاڵته‌ی له‌گه‌ل ده‌كه‌یت یاخود نوكته‌ی بۆ ده‌ڵێت { ناهه‌قیشی نیه‌) ، چونكه‌ له‌ پێناسه‌كه‌ی سه‌ره‌وه‌ هه‌ستده‌كه‌یت گه‌مه‌كردنێك هه‌یه‌ به‌ ووشه‌ { وه‌كو ئه‌وه‌ وایه‌ كه‌سێك پێناسه‌ی شتیكی بۆن ناخۆشت بۆ بكات و بڵێت هه‌ر شتێك بۆنی خۆش نه‌بێت ئه‌وا ناخۆشه‌ !}. به‌هه‌رحاڵ ، بۆ ئێمه‌ی بیركاریزان ئه‌م جۆره‌ پێناسانه‌ زۆر ئاسایین و له‌سه‌رجه‌م ئه‌ده‌بیاتی بیركاریدا به‌ئاشكرا بوونی هه‌یه‌ و ڕاهاتووین له‌گه‌ڵی. با بگه‌رێنه‌وه‌ بۆ پێناسه‌كه‌ كه‌ باسی ژماره‌یی ڕێژه‌یی مان كردووه‌، كه‌واته‌ بۆ تێگه‌یشتن له‌ ژماره‌ی ناڕێژه‌یی ده‌بێت سه‌ره‌تا باس له‌ژماره‌ی ڕێژه‌یی بكه‌یت، وه‌ هه‌ڵبه‌ت له‌ڕووی مێژوویشه‌وه‌ ئه‌مه‌ گونجاوه‌، چونكه‌ مێژووی دروستبوونی ژماره‌ی ڕێژه‌یی ده‌كه‌وێته‌ پێش مێژووی له‌دایكبوونی ژماره‌ ناڕێژه‌یه‌كان، وه‌ له‌دایكبوونه‌كه‌یشی زه‌حمه‌تی زۆری پێوه‌كێشرا ( به‌لایه‌نی كه‌مه‌وه‌ نه‌فه‌رێك له‌سه‌ر ژماره‌ ناڕێژه‌یه‌كان كوژرا). پێناسه‌ی ژماره‌یی ڕێژه‌یی:- به‌ژماره‌یه‌كی راستی ده‌وترێت ڕێژه‌یی گه‌ر هاتوو بتوانرێت به‌شێوه‌ی كه‌رتی وه‌كو بنوسرێت كاتێك هه‌ریه‌كه‌ له‌ ژماره‌كانی ژماره‌ی ته‌واو بن، وه‌ مه‌رجیشه‌ .   "
},
{
  "id": "section-2",
  "level": "1",
  "url": "section-2.html",
  "type": "[section]",
  "number": "1.2",
  "title": "ئایا کۆساینی شەس دەکاتە چەند؟",
  "body": " ئایا کۆساینی شەس دەکاتە چەند؟  ئەمە خۆیەتی  "
},
{
  "id": "colophon-2",
  "level": "1",
  "url": "colophon-2.html",
  "type": "[colophon]",
  "number": "",
  "title": "[colophon]",
  "body": " ئەم کتێبە لەڕێگای PreTeXt دروستکراوە.  "
}
]

var ptx_lunr_idx = lunr(function () {
  this.ref('id')
  this.field('title')
  this.field('body')

  ptx_lunr_docs.forEach(function (doc) {
    this.add(doc)
  }, this)
})
